// 1) შექმენით 5 ელემენტიანი სია, .push() მეთოდის გამოყენებით სიაში ჩაამატეთ თქვენი სახელი.

let lst = [1, 2, 3, 4, 5];
lst.push("shio");
console.log(lst);

// 2) იგივე სიის ბოლოდან ამოშალეთ ბოლო ელემენტი .pop() მეთოდის გამოყენებით.
lst.pop();
console.log(lst);

// 3) .join() მეთოდის მეშვეობით გააერთიანეთ ეს სია space-ით string-ის სახით.

console.log(lst.join(" "));
// 4) .slice() მეთოდის მეშვეობით სიიდან ამოიღეთ 0-ე ინდექსიდან 4-მდე ელემენტები და შესაბამისად დაბეჭდეთ.

console.log(lst.slice(0, 4));

// 5) .concat() მეთოდის გამოყენებით შეართეთ 2 სია ერთმანეთს და დაბეჭდეთ საბოლოო შედეგი.
let lst1 = ["omaghah", "nigga"];
let lst2 = ["digger", "black"];
console.log(lst1.concat(lst2));
