// 1)შექმენი ობიექტი სადაც გექნება name, age, city. გამოიტანე კონსოლში მსგავსი წინადადება My name is ___ and I live in ___

const myobj = {
  name: "shio",
  age: 11,
  city: "khashuri",
};
console.log(
  `my name is ${myobj.name} i am ${myobj.age} years old ad i live in ${myobj.city}`,
);

// 2)დაამატე პირველ დავალებაში შექმნილ ობიექტს ახალი გასაღები height

myobj.height = 1.98;

// 3)შეცვალე ისევ იგივე ობიექტში age გასაღები და გაუტოლე სხვა რიცხვს

myobj.name = "gio";

// 4)გამოიტანე ამ ობიექტში არსებული ყველა გასაღები და მნიშვნელობა

console.log(myobj);

// 5)შექმენი ახალი ობიექტი სადაც იქნება ჩაშენებული ფუნქცია, რომელიც დაპრინტავს წინადადებას "i study in group 77"

const obj = {
  info: () => {
    console.log("i study in group 77");
  },
};
obj.info();
// 6)თქვენს შესახებ შექმნილ ობიექტს გადაუარეთ ისევ for in-ით და წაშალეთ თითოეული კუთვნილება, შემდეგ გამოიტანეთ ეს ობიექტი კონსოლში

for (let i in myobj) {
  delete myobj[i];
}

// 7)შექმენით ცვლადი სადაც შეინახავთ თქვენს გვარს, შემდეგ გადაუარეთ for in-ის გამოყენებით და კომენტარის სახით ახსენი რას ინახავს საიტერაციო ცვლადი (შემდეგ ეს საიტერაციო ცვლადი გამოიყენეთ ისე როგორც ინდექსი (მაგ: surname[i]))

const lastname = "Labadze"
for(let i = 0; i<lastname.length;i++){
  console.log(lastname[i])
}
//საიტერაციო ცვლადი ინახავს ინდექსებს და როცა lastname[i] დავაკონსოლ ლოგეთ მან უკვე გამოიტანა გვარის ასოები 

